Revit 2024 API
IFCExtrusionCreationData.Slope Property
 The slope of the extrusion, in degrees.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public double Slope { get; set; }
Visual Basic
Public Property Slope As Double
	Get
	Set
Visual C++
public:
property double Slope {
	double get ();
	void set (double value);
}
Field Value
 Zero if the slope has never been set on this object.
See Also
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace